---
type: DGNImportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# DGNImportOptions

`Autodesk.Revit.DB.DGNImportOptions` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DGNImportOptions | — | `` |
| Constructor | DGNImportOptions | 2013 | `public DGNImportOptions ()` |
| Property | DGNModelViewName | 2013 | `public string DGNModelViewName { get ; set ; }` |
| Property | IgnoreUnsupportedElementWarning | 2013 | `public bool IgnoreUnsupportedElementWarning { get ; set ; }` |